## 1) Importing necessary libraries

In [3]:
import pandas as pd
import numpy as np

## (2) Importing dataset

In [4]:
data = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')

## (3) First 5 Rows

In [5]:
data.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

## (4) Last 10 Rows

In [6]:
data.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

## (5) Data Discribe

In [7]:
data.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

## (6) number of rows and columns respectively

In [8]:
data.shape[0]

943

In [9]:
data.shape[1]

4

## (7) Data type of each column

In [10]:
data.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

## (8) Mean age value

In [11]:
 data.age.mean()

34.05196182396607

## (9) different unique occupations

In [12]:
data.occupation.unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

## (10) less frequent age

In [20]:
data.age.value_counts().tail()

7     1
66    1
10    1
11    1
73    1
Name: age, dtype: int64